app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE (interest LIKE '%interest%' or skills LIKE)
SELECT "profiles".* FROM "profiles"
---
  def index
   # @profiles = Profile.all
    if params[:search_term]
      @profiles = Profile.where('interest LIKE ?', "%#{params[:search_term]}%")
    else
      @profiles = Profile.all

INSERT INTO "profiles" ("name", "address", "phone_no", "interest", "skills", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "updated_at" = ? WHERE "profiles"."id" = ?  [["updated_at", "2019-04-16 18:44:01.476515"], ["id", 4]]
---
  def create
    @profile = current_user.build_profile(profile_params)

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "interest" = ?, "skills" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["interest", "Interest"], ["skills", "Skills"], ["updated_at", "2019-04-16 18:49:17.092857"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)